USE ShopDB
GO

-------------------------------------------------------------------------
				/* Создем таблицу с именем MyFriends*/
-------------------------------------------------------------------------
CREATE TABLE MyFriends
(
	FrndId SMALLINT IDENTITY NOT NULL,
	FstName VARCHAR(20) NOT NULL,
	LstName VARCHAR(20) NULL,
	BthDate DATE NULL,
	Ntel CHAR(10) NOT NULL
)
GO

-------------------------------------------------------------------------
	-- Процедура sp_help возвращает сведения об объекте базы данных.
-------------------------------------------------------------------------

EXEC sp_help MyFriends

-------------------------------------------------------------------------
				/* Оператор вставки INSERT */
-------------------------------------------------------------------------

-- Записываем строку в таблицу MyFreand
INSERT INTO MyFriends
(FstName, BthDate, Ntel)
VALUES
('Max', 'Petrov', '02/03/1988', '093*******');
GO
-------------------------------------------------------------------------
-- Можно явно изменить порядок записываемых даных.
INSERT INTO MyFriends
(LstName, FstName, BthDate, Ntel)
VALUES
('Martinov', 'Kostya', '01/03/1986', '097*******');
GO
-------------------------------------------------------------------------

INSERT INTO MyFriends
 -- Указание порядка записи данных отсутствует, значит используем порядок по умолчанию.
VALUES
('Vitia', 'Sokolov', '01/03/1986', '095*******');
GO
-------------------------------------------------------------------------
INSERT INTO MyFriends
 -- Указание порядка записи данных отсутствует, значит используем порядок по умолчанию.
VALUES
('Sokolov', 'Vitia', '01/03/1986', '095*******'); --Ошибка очередности ввода!
GO

SELECT * FROM MyFriends
-------------------------------------------------------------------------
INSERT INTO MyFriends
VALUES 
 -- Нельзя оставлять пустыми поля помеченные ограничением NOT NULL
(NULL, 'Imelianov', '01/03/1986', '095*******');
GO
-------------------------------------------------------------------------
INSERT INTO MyFriends
VALUES
-- Допускается оставлять пустыми поля помеченные ограничением NULL 
('Vitia', null, '01/03/1986', '095*******');
GO
-------------------------------------------------------------------------
INSERT INTO MyFriends
(FstName,LstName,BthDate,Ntel) 
VALUES -- Начиная с 2008 SQL, допускается вводить несколько строк одновременно
('Max', 'Petrov', '02/21/1988', '093*******'),
('Alex', 'Vare', '03/20/1990', '093*******'),
('Sergei', 'Smolnikov', '05/31/1991', '093*******'),
('Petr', 'Vitiushkin', '03/06/1989', '093*******')
GO
-------------------------------------------------------------------------
INSERT INTO MyFriends
-- Указание порядка записи данных для несколиких строк не обязательно
VALUES
('Max', 'Petrov', '02/21/1988', '093*******'),
('Alex', 'Vare', '03/20/1990', '093*******'),
('Sergei', 'Smolnikov', '05/31/1991', '093*******'),
('Petr', 'Vitiushkin', '03/06/1989', '093*******');
GO
-------------------------------------------------------------------------