--***************************************************************************
--                       Целые типы данных в T-SQL
--***************************************************************************

-------------------------------------- Bit ----------------------------------

-- Целое без знака. Диапазон значений (0 или 1). 

PRINT 'Bit';

DECLARE @bit Bit = 0; 
PRINT @bit;

SET @bit = 1;
PRINT @bit;

SET @bit = -4; 
PRINT @bit;

------------------------------------- TinyInt -------------------------------

-- Целое без знака. Диапазон значений от 0 до 255.

PRINT 'TinyInt';

DECLARE @tinyint TinyInt = 0;
PRINT @tinyint;  

SET @tinyint = 25;
PRINT @tinyint;

SET @tinyint = 256; -- Ошибка
PRINT @tinyint;     -- Значение переменной @tinyint останется прежним.

----------------------------------- SmallInt --------------------------------

-- Целое со знаком. Диапазон значений от -32 768 до 32 767.

PRINT 'SmallInt';

DECLARE @smallint SmallInt = 32767;
PRINT @smallint;

SET @smallint = -32768;
PRINT @smallint;  

 -------------------------------------- Int ----------------------------------
 
 -- Целое со знаком. Диапазон значений от -2 147 483 648 до 2 147 483 647.
 
PRINT 'Int'

DECLARE @int Int = 2147483647;
PRINT @int;

SET @int = -2147483648;
PRINT @int;  

------------------------------------ BigInt ----------------------------------

-- Целое со знаком. Диапазон значений от -(2^63) до 2^63-1.

PRINT 'Bigint';

DECLARE @bigint Bigint = 9223372036854775807;
PRINT @bigint;

SET @bigint  = -9223372036854775808; 
PRINT @bigint; 

------------------------------------------------------------------------------
